# CreateRibbonPanel Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint..::..CreateRibbonPanel Method
ApplicationEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateRibbonPanel(String) | (Overrides UIApplication..::..CreateRibbonPanel(String).) |
| CreateRibbonPanel(String, String) | (Overrides UIApplication..::..CreateRibbonPanel(String, String).) |
| CreateRibbonPanel(Tab, String) | (Overrides UIApplication..::..CreateRibbonPanel(Tab, String).) |

# See Also
ApplicationEntryPoint Class
ApplicationEntryPoint Members
Autodesk.Revit.UI.Macros Namespace